Repository: Kostenkov-2021/TimerForNVDA
Catalog: addon/locale/*/LC_MESSAGES/nvda.po
Languages: ru

source: Timer for NVDA
ru: Таймер для NVDA

source: Timer for NVDA settings
ru: Настройки таймера для NVDA

source: Show settings dialog for Timer for NVDA addon
ru: Показать диалог настроек Таймера для NVDA

source: Shows the timer for NVDA settings dialog
ru: Показывает диалог настроек таймера для NVDA

source: Starts or stops timer or stopwatch
ru: Запускает или останавливает таймер или секундомер

source: Pauses or resumes a running timer or stopwatch
ru: Приостанавливает или возобновляет работу таймера или секундомера

source: Obtains status report from time or stopwatch
ru: Показывает информацию о состоянии таймера или секундомера

source: Resume
ru: Возобновить

source: Pause
ru: Приостановить

source: Time unit
ru: Единица времени

source: Type of watch
ru: Тип часов

source: start
ru: запустить

source: stop
ru: остановить

source: Report progress with sound
ru: Сообщать о состоянии с помощью звука

source: Report progress with speech
ru: Сообщать о состоянии с помощью речи

source: Close
ru: Закрыть

source: amount of
ru: количество

source: for
ru: для

source: timer
ru: таймер

source: stopwatch
ru: секундомер

source: Can not pause
ru: Невозможно приостановить

source: because it is not running
ru: потому что он не запущен

source: Can not resume
ru: Невозможно возобновить

source: because it is not paused
ru: потому что он не приостановлен

source: Initial time not configured. start aborted
ru: Начальное время не настроено. Запуск прерван

source: Could not mormalize time
ru: Не удалось нормализовать время

source: stopped
ru: остановлено

source: at
ru: на

source: (paused)
ru: (приостановлено)

source: elapsed
ru: истекло

source: to finish
ru: до завершения

source: Stopwatch
ru: Секундомер

source: Timer
ru: Таймер

source: seconds
ru: секунд

source: minutes
ru: минут

source: hours
ru: часов

source: second
ru: секунда

source: minute
ru: минута

source: hour
ru: час

source: Simple Timer and stopwatch for NVDA
ru: Простой таймер и секундомер для NVDA

source: This addon brings a fast, functional ande simple implementation of timer and stopwatch to be used with NVDA. Start a timer or stopwatch, using the time unit and reporting modes you need. Choose between speech, sound or no reporters. Monitor progress through reporters, settings dialog or anywhere using NVDA commands. Control timer and stopwatch from anywhere using NVDA commands.
ru: Это дополнение предлагает быструю, функциональную и простую реализацию таймера и секундомера для использования с NVDA. Запустите таймер или секундомер, используя нужные вам единицы времени и режимы объявления. Выберите между функциями: речь, звук или ничего. Отслеживайте ход с помощью обозревателей, диалога настроек или где-либо еще с помощью команд NVDA. Управляйте таймером и секундомером в любом месте с помощью команд NVDA.
